In [1]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame(np.arange(1,21).reshape(5,4),columns = ['one','two','three','four'])
df

In [7]:
result_df = map(lambda x:(x['three'] - x['two']),df[df['four']>12])

TypeError: string indices must be integers, not str

In [8]:
df.loc[df['four'] >= 12, 'four'] = df[df['four'] >= 12]['four'] - df[df['four'] >= 12]['two']
df

   one  two  three  four
0    1    2      3     4
1    5    6      7     8
2    9   10     11     2
3   13   14     15     2
4   17   18     19     2

In [10]:
a=0.01
b=0.01
a==b

True

In [35]:
df= pd.read_table('Table.txt',encoding='gbk',header=None)

In [33]:
df.size

9635

In [40]:
df['code']=map(lambda x:str(x).zfill(6),df[1])

In [42]:
s = '\n'.join(list(df['code'].values))

In [45]:
with open('msci_code.txt','w') as f:
    f.write(s)

In [6]:
df.set_index('one',drop=False)

     one  two  three  four
one
1      1    2      3     4
5      5    6      7     8
9      9   10     11    12
13    13   14     15    16
17    17   18     19    20

In [3]:
df

   one  two  three  four
0    1    2      3     4
1    5    6      7     8
2    9   10     11    12
3   13   14     15    16
4   17   18     19    20

In [2]:
data = pd.DataFrame({'Sample': range(1, 11), 'Gender': ['Female', 'Male', 'Female', 'Male', 'Male', 'Male', 'Female', 'Female', 'Male', 'Female'], 
                    'Handedness': ['Right-handed', 'Left-handed', 'Right-handed', 'Right-handed', 'Left-handed', 'Right-handed', 'Right-handed', 'Left-handed', 'Right-handed', 'Right-handed']})

In [3]:
data

   Sample  Gender    Handedness
0       1  Female  Right-handed
1       2    Male   Left-handed
2       3  Female  Right-handed
3       4    Male  Right-handed
4       5    Male   Left-handed
5       6    Male  Right-handed
6       7  Female  Right-handed
7       8  Female   Left-handed
8       9    Male  Right-handed
9      10  Female  Right-handed

In [8]:
pd.crosstab(data.Gender,data.Handedness,margins=True)

Handedness  Left-handed  Right-handed  All
Gender
Female                1             4    5
Male                  2             3    5
All                   3             7   10